## Plan for scanners/owasp-zap
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.security_tools_web_scanning must be replaced
-/+ resource "aws_security_group" "security_tools_web_scanning" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:507252742351:security-group/sg-0711e8c6c24e225c7" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Security group rule for egress to port 443"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Security group rule for egress to port 80"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> (known after apply)
      ~ id                     = "sg-0711e8c6c24e225c7" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "web-security-scanners-sg" -> "web-security-scanners-sg " # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "507252742351" -> (known after apply)
        tags                   = {
            "CostCenter" = "scan-websites"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_security_group_rule.web_port_443_egress must be replaced
-/+ resource "aws_security_group_rule" "web_port_443_egress" {
      ~ id                       = "sgrule-1730141352" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-0711e8c6c24e225c7" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_security_group_rule.web_port_80_egress must be replaced
-/+ resource "aws_security_group_rule" "web_port_80_egress" {
      ~ id                       = "sgrule-1764123408" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-0711e8c6c24e225c7" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>